src/cfe/DataProcessors/OData4_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>OData4_Настройки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/InformationRegisters/OData4_Состав.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_Состав</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включён</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключённыеТабличныеЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключённыеПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/OData4_ПрофилиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_ПрофилиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.OData4_Профили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/OData4_Журнал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_Журнал</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/DataProcessors/OData4_Настройки/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСпискиВыбора();
	ПрочитатьНастройки();
	ПрочитатьСоставНаСервере();
	ПрочитатьДоступНаСервере();
	Состояние = OData4_Движок.СостояниеКомпоненты();
	Если Состояние.БезопасныйРежим Тогда
		СостояниеКомпоненты = "Не подключается: расширение в безопасном режиме. Разбор, выдача и $metadata — на языке 1С.";
		// Режимы этапа 8 без компоненты не действуют (OData4_Движок.РежимДвижка): поля только для чтения.
		Для Каждого Имя Из СтрРазделить("Настройки_РежимВыдачи,Настройки_РежимРазбораТел,Настройки_РежимМетаданных", ",") Цикл
			Элементы[Имя].Доступность = Ложь;
		КонецЦикла;
	ИначеЕсли Состояние.Доступна Тогда
		СостояниеКомпоненты = "Доступна, версия " + Состояние.Версия;
	Иначе
		СостояниеКомпоненты = "Недоступна: " + Состояние.Ошибка;
	КонецЕсли;
	ЭлементПорядка = Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Время");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	ЭлементПорядка.Использование = Истина;
	ОтборСтатус = "";
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Серверные вызовы при завершении работы запрещены, поэтому признак изменений — только клиентский
	// (блокер ручной проверки: закрытие клиента с открытой формой давало ошибку).
	Если Не ЕстьИзменения() Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	Если ЗавершениеРаботы Тогда
		ТекстПредупреждения = "Настройки OData4 не записаны.";
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Настройки изменены. Записать?", РежимДиалогаВопрос.ДаНетОтмена);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// Экспорт — для клиентского теста формы (он же пересобирает надписи через УправлениеФормой).
&НаКлиенте
Процедура РежимЗаписиЖурналаПриИзменении(Элемент) Экспорт
	ВосстановитьЗначениеИзСписка(Элемент);
	Модифицированность = Истина;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПачкаЖурналаПриИзменении(Элемент)
	Модифицированность = Истина;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	Модифицированность = Истина;
	ЗаполнитьАдреса(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТокеныПродолженияПриИзменении(Элемент)
	Модифицированность = Истина;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РежимПравПриИзменении(Элемент)
	ВосстановитьЗначениеИзСписка(Элемент);
	Модифицированность = Истина;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПрофильПользователяПриИзменении(Элемент)
	ПрофилиПользователейИзменены = Истина;
	Модифицированность = Истина;
КонецПроцедуры

// Отметка служебной учётки — такая же правка настроек, как любое поле (дефект приёмки Р1: отметку теряли
// молча, потому что флажок таблицы не сообщал форме об изменении).
&НаКлиенте
Процедура СлужебнаяУчёткаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	ПрименитьОтбор();
КонецПроцедуры

// Вкладка «Удаление» (план 6.3, решение 8): чек-лист физического удаления считается при первом открытии вкладки
// и по кнопке «Проверить» — на открытие формы он времени не тратит.
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаУдаление И Не ЧекЛистПроверен Тогда
		ОбновитьЧекЛистУдаления();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьУдаление(Команда)
	ОбновитьЧекЛистУдаления();
КонецПроцедуры

// Экспорт — для клиентского теста формы.
&НаКлиенте
Процедура ОбновитьЧекЛистУдаления() Экспорт
	ПроверитьУдалениеНаСервере();
КонецПроцедуры

// Пункты OData4_ПроверкаУдаления по значениям полей формы (режим и отмеченные служебные учётки — ещё не
// записанные).
&НаСервере
Процедура ПроверитьУдалениеНаСервере()
	Значения = Новый Структура("РазрешитьФизическоеУдаление, СлужебныеПользователи, РежимПравСлужебногоПользователя",
		Настройки_РазрешитьФизическоеУдаление, СлужебныеУчёткиСтрокой(), Настройки_РежимПравСлужебногоПользователя);
	ЧекЛистУдаления.Очистить();
	Для Каждого Пункт Из OData4_ПроверкаУдаления.Пункты(Значения) Цикл
		ЗаполнитьЗначенияСвойств(ЧекЛистУдаления.Добавить(), Пункт);
	КонецЦикла;
	ЧекЛистПроверен = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	Если ЗаписатьНаКлиенте() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	ЗаписатьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеречитать(Команда)
	ПрочитатьНастройки();
	ПрочитатьСоставНаСервере();
	ПрочитатьДоступНаСервере();
	Модифицированность = Ложь;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьПрофиль(Команда)
	ОткрытьКарточкуПрофиля(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьПрофиль(Команда)
	Текущий = Элементы.СписокПрофилей.ТекущаяСтрока;
	Если Текущий = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите профиль в списке.");
		Возврат;
	КонецЕсли;
	ОткрытьКарточкуПрофиля(Текущий);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПометитьПрофильНаУдаление(Команда)
	Текущий = Элементы.СписокПрофилей.ТекущаяСтрока;
	Если Текущий = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите профиль в списке.");
		Возврат;
	КонецЕсли;
	Вопрос = ?(ПометкаУдаленияТекущегоПрофиля(), "Снять пометку удаления с профиля ", "Пометить на удаление профиль ")
		+ """" + Строка(Текущий) + """?";
	Оповещение = Новый ОписаниеОповещения("ПометитьПрофильЗавершение", ЭтотОбъект, Текущий);
	ПоказатьВопрос(Оповещение, Вопрос, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура СписокПрофилейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуПрофиля(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокПрофилейПриАктивизацииСтроки(Элемент) Экспорт
	Элементы.ПометитьПрофильНаУдаление.Заголовок = ЗаголовокКнопкиПометки(ПометкаУдаленияТекущегоПрофиля());
КонецПроцедуры

// Заголовок кнопки пометки удаления по состоянию текущего профиля. Экспорт — для клиентского теста формы.
&НаКлиенте
Функция ЗаголовокКнопкиПометки(ПометкаУдаления) Экспорт
	Возврат ?(ПометкаУдаления, "Снять пометку", "Пометить на удаление");
КонецФункции

&НаКлиенте
Процедура СписокТокеновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	ПоказатьПредупреждение(, "Токены изменяются кнопками «Выпустить», «Отозвать» и «Продлить».");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыпуститьТокен(Команда)
	Параметры0 = Новый Структура("АдресТокенов", АдресТокен);
	ОткрытьФорму("Обработка.OData4_Настройки.Форма.ВыпускТокена", Параметры0, ЭтотОбъект,
		Новый УникальныйИдентификатор, , , Новый ОписаниеОповещения("ПослеВыпускаТокена", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтозватьТокен(Команда)
	Текущий = Элементы.СписокТокенов.ТекущаяСтрока;
	Если Текущий = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите токен в списке.");
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ОтозватьТокенЗавершение", ЭтотОбъект, Текущий);
	ПоказатьВопрос(Оповещение, "Отозвать токен """ + Строка(Текущий) + """? Отзыв окончателен: продлить "
		+ "отозванный токен нельзя, доступ восстанавливается только выпуском нового.", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродлитьТокен(Команда)
	Текущий = Элементы.СписокТокенов.ТекущаяСтрока;
	Если Текущий = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите токен в списке.");
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПродлитьТокенЗавершение", ЭтотОбъект, Текущий);
	ПоказатьВводДаты(Оповещение, НачалоДня(ТекущаяДата()) + 30 * 86400, "Новый срок действия токена",
		ЧастиДаты.ДатаВремя);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьЖурнал(Команда)
	ОбновитьЖурнал();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьСтарыеЗаписи(Команда)
	Текст = ОчиститьСтарыеЗаписиНаСервере(Настройки_СрокХраненияЖурнала);
	ОбновитьЖурнал();
	ПоказатьПредупреждение(, Текст);
КонецПроцедуры

#КонецОбласти

#Область Состав

// Вкладка «Состав» (задача 8 плана 5.3). Дерево ДеревоСостава: ветки — виды объектов, публикуемые моделью; под
// ними — объекты конфигурации; табличные части и поля объекта загружаются при разворачивании. Снятый флажок
// поля или табличной части включённого объекта — исключение. Регистр OData4_Состав пишется при записи формы,
// только если состав менялся на форме.

&НаКлиенте
Процедура ДеревоСоставаПередРазворачиванием(Элемент, ИдентификаторСтроки, Отказ)
	Данные = ДеревоСостава.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Данные <> Неопределено И Данные.Вид = "Объект" И Не Данные.ЗагруженоДетей Тогда
		ЗагрузитьДетей(Данные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСоставаВключёнПриИзменении(Элемент)
	Данные = Элементы.ДеревоСостава.ТекущиеДанные;
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Данные.Вид = "Ветка" Тогда
		Для Каждого СтрокаОбъекта Из Данные.ПолучитьЭлементы() Цикл
			СтрокаОбъекта.Включён = Данные.Включён;
		КонецЦикла;
	ИначеЕсли Данные.Вид = "Объект" Тогда
		ОбновитьФлажокВетки(Данные.ПолучитьРодителя());
	ИначеЕсли Данные.Вид = "Поле" И Данные.Ключевое И Не Данные.Включён Тогда
		Данные.Включён = Истина;
		ПоказатьПредупреждение(, "Поле «" + Данные.Представление + "» входит в ключ набора и не исключается.");
		Возврат;
	ИначеЕсли Данные.Вид = "Заглушка" Тогда
		Данные.Включён = Ложь;
		Возврат;
	КонецЕсли;
	ОтметитьИзменениеСостава();
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьВсёИзВетки(Команда)
	Данные = Элементы.ДеревоСостава.ТекущиеДанные;
	Если Данные = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите ветку или объект в дереве состава.");
		Возврат;
	КонецЕсли;
	Пока Данные.ПолучитьРодителя() <> Неопределено Цикл
		Данные = Данные.ПолучитьРодителя();
	КонецЦикла;
	ВключитьВсёИзВетки(Данные);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИзСтандартногоИнтерфейса(Команда)
	ЗаполнитьИзСтандартногоИнтерфейсаНаСервере();
	ОтметитьИзменениеСостава();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПредупреждения(Команда)
	ОбновитьПредупрежденияНаСервере();
КонецПроцедуры

// Включает все объекты ветки (верхний уровень дерева).
&НаКлиенте
Процедура ВключитьВсёИзВетки(Ветка) Экспорт
	Для Каждого СтрокаОбъекта Из Ветка.ПолучитьЭлементы() Цикл
		СтрокаОбъекта.Включён = Истина;
	КонецЦикла;
	Ветка.Включён = Ветка.ПолучитьЭлементы().Количество() > 0;
	ОтметитьИзменениеСостава();
КонецПроцедуры

// Табличные части и поля объекта (строки дерева вместо заглушки); флажки — по спискам исключений объекта.
&НаКлиенте
Процедура ЗагрузитьДетей(Данные) Экспорт
	Дети = ДетиОбъекта(Данные.ПолноеИмя, Данные.ИсключённыеТЧ, Данные.ИсключённыеПоля);
	Строки0 = Данные.ПолучитьЭлементы();
	Строки0.Очистить();
	Для Каждого Описание Из Дети Цикл
		Новая = Строки0.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Описание, "Имя, Представление, ПолноеИмя, Вид, Включён, Ключевое");
		Новая.ЗагруженоДетей = Истина;
		Для Каждого Поле Из Описание.Поля Цикл
			НовоеПоле = Новая.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовоеПоле, Поле, "Имя, Представление, ПолноеИмя, Вид, Включён, Ключевое");
			НовоеПоле.ЗагруженоДетей = Истина;
		КонецЦикла;
	КонецЦикла;
	Данные.ЗагруженоДетей = Истина;
КонецПроцедуры

// Флажок ветки: Истина — включены все объекты вида, иначе Ложь. Трёхсостоянийный флажок пришлось убрать:
// он требует колонку дерева без типа, а с ней платформа показывает «Да»/«Нет» текстом и открывает при правке
// диалог выбора типа (блокер ручной проверки). Колонка — Булево, флажок обычный.
&НаКлиенте
Процедура ОбновитьФлажокВетки(Ветка)
	Если Ветка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Все = Ветка.ПолучитьЭлементы().Количество() > 0;
	Для Каждого СтрокаОбъекта Из Ветка.ПолучитьЭлементы() Цикл
		Все = Все И СтрокаОбъекта.Включён;
	КонецЦикла;
	Ветка.Включён = Все;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьИзменениеСостава()
	СоставИзменён = Истина;
	Модифицированность = Истина;
	ОбновитьПризнакПустогоСостава();
КонецПроцедуры

// Предупреждение о пустом составе пересчитывается сразу при изменении дерева (замечание пользователя 8);
// полный список предупреждений и оценка размера — по кнопке «Обновить предупреждения» (они считаются секунды).
&НаКлиенте
Процедура ОбновитьПризнакПустогоСостава()
	// Прежние предупреждения относятся к прежнему дереву: показывать их рядом с новой подсказкой нельзя.
	ПредупрежденияСостава.Очистить();
	Есть = Ложь;
	Для Каждого Ветка Из ДеревоСостава.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаОбъекта Из Ветка.ПолучитьЭлементы() Цикл
			Если СтрокаОбъекта.Включён Тогда
				Есть = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Есть Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ОценкаРазмера = ?(Есть, "",
		"Состав пуст: после записи сервис ничего не публикует.");
КонецПроцедуры

// Дерево по регистру OData4_Состав: пустой регистр — отмечен состав стандартного интерфейса.
&НаСервере
Процедура ПрочитатьСоставНаСервере()
	Прочитанный = OData4_Состав.ПрочитатьСостав();
	Исключения = Новый Соответствие;
	Для Каждого Строка0 Из Прочитанный.Строки Цикл
		Исключения.Вставить(Строка0.ПолноеИмя, Новый Структура("ТЧ, Поля", Строка0.ТЧ, Строка0.Поля));
	КонецЦикла;
	ЗаполнитьДерево(OData4_Состав.СоставПоСтрокам(Прочитанный.Строки), Исключения);
	Если Прочитанный.Строки.Количество() = 0 Тогда
		СостояниеСостава = "Состав не задан: публикуется состав стандартного интерфейса OData. После записи формы "
			+ "состав фиксируется и за стандартным интерфейсом не следует.";
	Иначе
		СостояниеСостава = "Публикуются отмеченные объекты; снятый флажок поля или табличной части исключает его.";
	КонецЕсли;
	СоставИзменён = Ложь;
	ПредупрежденияСостава.Очистить();
	ОценкаРазмера = "";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзСтандартногоИнтерфейсаНаСервере()
	ЗаполнитьДерево(OData4_Состав.СоставСтандартногоИнтерфейса(), Новый Соответствие);
	ПредупрежденияСостава.Очистить();
	ОценкаРазмера = "";
КонецПроцедуры

// Ветки видов и объекты; у объекта — заглушка, чтобы дерево показывало возможность развернуть.
&НаСервере
Процедура ЗаполнитьДерево(Состав, Исключения)
	Дерево = РеквизитФормыВЗначение("ДеревоСостава");
	Дерево.Строки.Очистить();
	Для Каждого Вид Из ВидыСостава() Цикл
		Ветка = Дерево.Строки.Добавить();
		Ветка.Имя = Вид.Коллекция;
		Ветка.Представление = Вид.Представление;
		Ветка.Вид = "Ветка";
		Ветка.ЗагруженоДетей = Истина;
		Объекты = Новый СписокЗначений;
		Для Каждого ОбъектМетаданных Из Метаданные[Вид.Коллекция] Цикл
			Если Не СтрНачинаетсяС(ОбъектМетаданных.Имя, "OData4_") Тогда
				Объекты.Добавить(ОбъектМетаданных, ОбъектМетаданных.Имя);
			КонецЕсли;
		КонецЦикла;
		Объекты.СортироватьПоПредставлению();
		Включено = 0;
		Для Каждого Элемент Из Объекты Цикл
			ОбъектМетаданных = Элемент.Значение;
			Строка0 = Ветка.Строки.Добавить();
			Строка0.Имя = ОбъектМетаданных.Имя;
			Строка0.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
			Строка0.Представление = ПредставлениеМетаданных(ОбъектМетаданных);
			Строка0.Вид = "Объект";
			Строка0.Включён = Состав.Получить(Строка0.ПолноеИмя) <> Неопределено;
			Описание = Исключения.Получить(Строка0.ПолноеИмя);
			Если Описание <> Неопределено Тогда
				Строка0.ИсключённыеТЧ = Описание.ТЧ;
				Строка0.ИсключённыеПоля = Описание.Поля;
			КонецЕсли;
			Строка0.Строки.Добавить().Вид = "Заглушка";
			Включено = Включено + ?(Строка0.Включён, 1, 0);
		КонецЦикла;
		Ветка.Включён = Объекты.Количество() > 0 И Включено = Объекты.Количество();
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево, "ДеревоСостава");
КонецПроцедуры

// Виды объектов, которые публикует модель (OData4_Состав.ПубликуемыйВид): коллекция Метаданные и заголовок ветки.
&НаСервереБезКонтекста
Функция ВидыСостава()
	Виды = Новый Массив;
	Описания = "Справочники:Справочники,Документы:Документы,ЖурналыДокументов:Журналы документов,"
		+ "Константы:Константы,ПланыВидовХарактеристик:Планы видов характеристик,ПланыСчетов:Планы счетов,"
		+ "ПланыВидовРасчета:Планы видов расчёта,ПланыОбмена:Планы обмена,БизнесПроцессы:Бизнес-процессы,"
		+ "Задачи:Задачи,РегистрыСведений:Регистры сведений,РегистрыНакопления:Регистры накопления,"
		+ "РегистрыБухгалтерии:Регистры бухгалтерии,РегистрыРасчета:Регистры расчёта";
	Для Каждого Пара Из СтрРазделить(Описания, ",") Цикл
		Части = СтрРазделить(Пара, ":");
		Виды.Добавить(Новый Структура("Коллекция, Представление", Части[0], Части[1]));
	КонецЦикла;
	Возврат Виды;
КонецФункции

// Дети объекта: Массив Структура("Имя, Представление, ПолноеИмя, Вид, Включён, Поля") — сначала поля объекта
// (Вид «Поле», Поля пуст), затем табличные части (Вид «ТабличнаяЧасть», Поля — их поля). ПолноеИмя поля — имя
// в списке исключений: «Реквизит» или «ИмяТЧ.Реквизит» (стандартные — по русскому имени).
&НаСервереБезКонтекста
Функция ДетиОбъекта(ПолноеИмя, ИсключённыеТЧ, ИсключённыеПоля) Экспорт
	Описание0 = OData4_Состав.ОписаниеОбъекта(ИсключённыеТЧ, ИсключённыеПоля);
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Дети = Новый Массив;
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Дети;
	КонецЕсли;
	Имена = Новый Массив;
	Ключевые = ПоляКлюча(ОбъектМетаданных, ПолноеИмя);
	Если Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
		ДобавитьПоле(Дети, Имена, "Значение", "Значение", "", Описание0, Ключевые);
	КонецЕсли;
	Для Каждого ИмяКоллекции Из СтрРазделить("СтандартныеРеквизиты,Реквизиты,Измерения,Ресурсы,РеквизитыАдресации,"
		+ "ПризнакиУчета,Графы", ",") Цикл
		Для Каждого Поле Из КоллекцияМетаданных(ОбъектМетаданных, ИмяКоллекции) Цикл
			ДобавитьПоле(Дети, Имена, Поле.Имя, ПредставлениеМетаданных(Поле), "", Описание0, Ключевые);
		КонецЦикла;
	КонецЦикла;
	Для Каждого ТабличнаяЧасть Из КоллекцияМетаданных(ОбъектМетаданных, "ТабличныеЧасти") Цикл
		ДобавитьТабличнуюЧасть(Дети, ТабличнаяЧасть, КоллекцияМетаданных(ТабличнаяЧасть, "Реквизиты"), Описание0);
	КонецЦикла;
	Для Каждого ТабличнаяЧасть Из КоллекцияМетаданных(ОбъектМетаданных, "СтандартныеТабличныеЧасти") Цикл
		Поля = Новый Массив;
		Для Каждого Поле Из КоллекцияМетаданных(ТабличнаяЧасть, "СтандартныеРеквизиты") Цикл
			Поля.Добавить(Поле);
		КонецЦикла;
		Если ТабличнаяЧасть.Имя = "ВидыСубконто" Тогда
			Для Каждого Поле Из КоллекцияМетаданных(ОбъектМетаданных, "ПризнакиУчетаСубконто") Цикл
				Поля.Добавить(Поле);
			КонецЦикла;
		КонецЕсли;
		ДобавитьТабличнуюЧасть(Дети, ТабличнаяЧасть, Поля, Описание0);
	КонецЦикла;
	Возврат Дети;
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьТабличнуюЧасть(Дети, ТабличнаяЧасть, Поля, Описание0)
	Строка0 = Новый Структура("Имя, Представление, ПолноеИмя, Вид, Включён, Поля, Ключевое", ТабличнаяЧасть.Имя,
		ПредставлениеМетаданных(ТабличнаяЧасть), ТабличнаяЧасть.Имя, "ТабличнаяЧасть",
		Описание0.ИсключённыеТЧ.Найти(ТабличнаяЧасть.Имя) = Неопределено, Новый Массив, Ложь);
	Имена = Новый Массив;
	Ключевые = СтрРазделить("НомерСтроки", ",");
	Для Каждого Поле Из Поля Цикл
		ДобавитьПоле(Строка0.Поля, Имена, Поле.Имя, ПредставлениеМетаданных(Поле), ТабличнаяЧасть.Имя + ".",
			Описание0, Ключевые);
	КонецЦикла;
	Дети.Добавить(Строка0);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПоле(Дети, Имена, Имя, Представление, Префикс, Описание0, Ключевые = Неопределено)
	Если Имена.Найти(Имя) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	Имена.Добавить(Имя);
	Поле = Новый Структура("Имя, Представление, ПолноеИмя, Вид, Включён, Поля, Ключевое", Имя, Представление,
		Префикс + Имя, "Поле", Описание0.ИсключённыеПоля.Найти(Префикс + Имя) = Неопределено, Новый Массив,
		Ключевые <> Неопределено И Ключевые.Найти(Имя) <> Неопределено);
	Если Поле.Ключевое Тогда
		Поле.Включён = Истина;
	КонецЕсли;
	Дети.Добавить(Поле);
КонецПроцедуры

// Поля ключа объекта, которые нельзя исключать (то же правило, что у предупреждения 5.1 «ПолеКлюча»).
&НаСервереБезКонтекста
Функция ПоляКлюча(ОбъектМетаданных, ПолноеИмя)
	Ключевые = СтрРазделить("Ссылка,НомерСтроки,Регистратор", ",");
	Если СтрРазделить(ПолноеИмя, ".")[0] = "РегистрСведений" Тогда
		Ключевые.Добавить("Период");
		Для Каждого Поле Из ОбъектМетаданных.Измерения Цикл
			Ключевые.Добавить(Поле.Имя);
		КонецЦикла;
	КонецЕсли;
	Возврат Ключевые;
КонецФункции

// Коллекция объекта метаданных по имени; у объекта нет такой коллекции — пустой массив.
&НаСервереБезКонтекста
Функция КоллекцияМетаданных(ОбъектМетаданных, ИмяКоллекции)
	Попытка
		Возврат ОбъектМетаданных[ИмяКоллекции];
	Исключение
		Возврат Новый Массив;
	КонецПопытки;
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеМетаданных(ОбъектМетаданных)
	Синоним = "";
	Попытка
		Синоним = ОбъектМетаданных.Синоним;
	Исключение
		Синоним = "";
	КонецПопытки;
	Если ПустаяСтрока(Синоним) Или Синоним = ОбъектМетаданных.Имя Тогда
		Возврат ОбъектМетаданных.Имя;
	КонецЕсли;
	Возврат Синоним + " (" + ОбъектМетаданных.Имя + ")";
КонецФункции

// Строки регистра по дереву: Массив Структура("ПолноеИмя, ТЧ, Поля") включённых объектов. Объект, чьи дети не
// загружались, сохраняет прочитанные списки исключений.
&НаСервере
Функция СтрокиСоставаИзДерева()
	Результат = Новый Массив;
	Для Каждого Ветка Из ДеревоСостава.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаОбъекта Из Ветка.ПолучитьЭлементы() Цикл
			Если Не СтрокаОбъекта.Включён Тогда
				Продолжить;
			КонецЕсли;
			ТЧ = СтрокаОбъекта.ИсключённыеТЧ;
			Поля = СтрокаОбъекта.ИсключённыеПоля;
			Если СтрокаОбъекта.ЗагруженоДетей Тогда
				ИменаТЧ = Новый Массив;
				ИменаПолей = Новый Массив;
				Для Каждого Ребёнок Из СтрокаОбъекта.ПолучитьЭлементы() Цикл
					Если Ребёнок.Вид = "Поле" И Не Ребёнок.Включён Тогда
						ИменаПолей.Добавить(Ребёнок.ПолноеИмя);
					ИначеЕсли Ребёнок.Вид = "ТабличнаяЧасть" И Не Ребёнок.Включён Тогда
						ИменаТЧ.Добавить(Ребёнок.ПолноеИмя);
					ИначеЕсли Ребёнок.Вид = "ТабличнаяЧасть" Тогда
						Для Каждого Поле Из Ребёнок.ПолучитьЭлементы() Цикл
							Если Не Поле.Включён Тогда
								ИменаПолей.Добавить(Поле.ПолноеИмя);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				ТЧ = СтрСоединить(ИменаТЧ, ",");
				Поля = СтрСоединить(ИменаПолей, ",");
			КонецЕсли;
			Результат.Добавить(Новый Структура("ПолноеИмя, ТЧ, Поля", СтрокаОбъекта.ПолноеИмя, ТЧ, Поля));
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Состав по дереву в форме OData4_Состав.ДействующийСостав (для предупреждений).
&НаСервере
Функция СоставИзДерева()
	Состав = Новый Соответствие;
	Для Каждого Строка0 Из СтрокиСоставаИзДерева() Цикл
		Состав.Вставить(Строка0.ПолноеИмя, OData4_Состав.ОписаниеОбъекта(Строка0.ТЧ, Строка0.Поля));
	КонецЦикла;
	Возврат Состав;
КонецФункции

// Регистр OData4_Состав целиком одним набором (одна транзакция). Ни одного включённого объекта — одна запись
// с Включён = Ложь: регистр непуст, состав пуст (пустой регистр означал бы стандартный интерфейс).
&НаСервере
Процедура ЗаписатьСостав()
	Набор = РегистрыСведений.OData4_Состав.СоздатьНаборЗаписей();
	Для Каждого Строка0 Из СтрокиСоставаИзДерева() Цикл
		Запись = Набор.Добавить();
		Запись.ПолноеИмя = Строка0.ПолноеИмя;
		Запись.Включён = Истина;
		Запись.ИсключённыеТабличныеЧасти = Строка0.ТЧ;
		Запись.ИсключённыеПоля = Строка0.Поля;
	КонецЦикла;
	Если Набор.Количество() = 0 Тогда
		Для Каждого Ветка Из ДеревоСостава.ПолучитьЭлементы() Цикл
			Если Ветка.ПолучитьЭлементы().Количество() > 0 Тогда
				Запись = Набор.Добавить();
				Запись.ПолноеИмя = Ветка.ПолучитьЭлементы()[0].ПолноеИмя;
				Запись.Включён = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредупрежденияНаСервере()
	Состав = СоставИзДерева();
	Оценка = OData4_Состав.ОценкаРазмераМетаданных(Состав);
	ПредупрежденияСостава.Очистить();
	Для Каждого Предупреждение0 Из OData4_Состав.Предупреждения(Состав, Оценка) Цикл
		ЗаполнитьЗначенияСвойств(ПредупрежденияСостава.Добавить(), Предупреждение0, "Объект, Текст");
	КонецЦикла;
	ОценкаРазмера = "Оценка размера $metadata: " + Формат(Оценка / 1048576, "ЧДЦ=1; ЧН=0; ЧГ=0") + " МБ";
КонецПроцедуры

#КонецОбласти

#Область Доступ

// Вкладки «Аутентификация» и «Пользователи» (задача 10 плана 5.3): настройки доступа 5.2, служебные учётки
// (ресурс СлужебныеПользователи — имена через перевод строки) и сопоставление «пользователь ИБ → профиль»
// (регистр OData4_ПрофилиПользователей, пишется целиком при записи формы).

// Списки выбора режимов: значения — как в OData4_Безопасность.НастройкиДоступа. Поля — с выбором только из
// списка (решение 28 плана 5.3: переключатель RadioButtonField платформа в файле формы расширения не приняла).
&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	// Выбор только из списка: поле показывает представление значения («Только запись», а не «Запись»; Н-3). Сами
	// списки заданы в форме: у списков, заполненных кодом, очистка поля оставляла его пустым (Н-4).
	Для Каждого Имя Из СтрРазделить("Настройки_РежимДат,Настройки_УровеньЖурнала,Настройки_РежимЗаписиЖурнала,"
		+ "Настройки_РежимПримененияПрофиля,Настройки_РежимПравСлужебногоПользователя,"
		+ "Настройки_РазрешитьФизическоеУдаление,Настройки_РежимПроведения,Настройки_РежимВыдачи,Настройки_РежимРазбораТел,"
		+ "Настройки_РежимМетаданных,Настройки_ПроверкаКонфигурации,Настройки_ВыдачаКоллекций,"
		+ "Настройки_ПроверкаСсылокЗаписи,Настройки_КлючПриСоздании,Настройки_ПоискСсылокПриУдалении", ",") Цикл
		Элементы[Имя].РежимВыбораИзСписка = Истина;
	КонецЦикла;
КонецПроцедуры

// Таблицы вкладок «Аутентификация» и «Пользователи» и предупреждение об опасных настройках доступа.
&НаСервере
Процедура ПрочитатьДоступНаСервере()
	Отмеченные = Новый Соответствие;
	Для Каждого Имя Из СтрРазделить(Настройки_СлужебныеПользователи, Символы.ПС + ",", Ложь) Цикл
		Отмеченные.Вставить(СокрЛП(Имя), Истина);
	КонецЦикла;
	Профили = Новый Соответствие;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	П.Пользователь КАК Пользователь,
		|	П.Профиль КАК Профиль
		|ИЗ
		|	РегистрСведений.OData4_ПрофилиПользователей КАК П");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Профили.Вставить(Выборка.Пользователь, Выборка.Профиль);
	КонецЦикла;
	СлужебныеУчётки.Очистить();
	ПользователиПрофили.Очистить();
	Имена = Новый Массив;
	Для Каждого Пользователь Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		Имена.Добавить(Пользователь.Имя);
	КонецЦикла;
	Для Каждого Имя Из Отмеченные Цикл
		Если Имена.Найти(Имя.Ключ) = Неопределено Тогда
			// Учётка из настроек, которой уже нет в списке пользователей ИБ: показывается, чтобы отметку можно было снять.
			Имена.Добавить(Имя.Ключ);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Имя Из OData4_Модель.УпорядочитьСтроки(Имена) Цикл
		Учётка = СлужебныеУчётки.Добавить();
		Учётка.Пользователь = Имя;
		Учётка.Отмечен = Отмеченные.Получить(Имя) = Истина;
		Строка0 = ПользователиПрофили.Добавить();
		Строка0.Пользователь = Имя;
		Строка0.Профиль = Профили.Получить(Имя);
	КонецЦикла;
	ПрофилиПользователейИзменены = Ложь;
	ОбновитьПредупреждениеДоступа();
КонецПроцедуры

// Надпись об опасных настройках доступа: каждая с новой строки и с точкой в конце (пересобирается и после
// записи формы, замечание ручной проверки).
&НаСервере
Процедура ОбновитьПредупреждениеДоступа()
	Тексты = Новый Массив;
	Для Каждого Опасное Из OData4_Безопасность.ОпасныеНастройки() Цикл
		Текст = СокрЛП(Опасное.Текст);
		Тексты.Добавить(Текст + ?(СтрЗаканчиваетсяНа(Текст, "."), "", "."));
	КонецЦикла;
	ПредупреждениеДоступа = ?(Тексты.Количество() = 0, "Опасных настроек доступа нет.",
		"Опасные настройки:" + Символы.ПС + СтрСоединить(Тексты, Символы.ПС));
КонецПроцедуры

// Отмеченные служебные учётки строкой ресурса СлужебныеПользователи (имена через перевод строки).
&НаСервере
Функция СлужебныеУчёткиСтрокой()
	Имена = Новый Массив;
	Для Каждого Учётка Из СлужебныеУчётки Цикл
		Если Учётка.Отмечен Тогда
			Имена.Добавить(Учётка.Пользователь);
		КонецЕсли;
	КонецЦикла;
	Возврат СтрСоединить(Имена, Символы.ПС);
КонецФункции

// Регистр OData4_ПрофилиПользователей целиком: строки с заполненным профилем.
&НаСервере
Процедура ЗаписатьПрофилиПользователей()
	Набор = РегистрыСведений.OData4_ПрофилиПользователей.СоздатьНаборЗаписей();
	Для Каждого Строка0 Из ПользователиПрофили Цикл
		Если ЗначениеЗаполнено(Строка0.Профиль) Тогда
			Запись = Набор.Добавить();
			Запись.Пользователь = Строка0.Пользователь;
			Запись.Профиль = Строка0.Профиль;
		КонецЕсли;
	КонецЦикла;
	Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыпускаТокена(Результат, ДополнительныеПараметры) Экспорт
	Элементы.СписокТокенов.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьТокенЗавершение(Ответ, Токен) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Текст = ОтозватьНаСервере(Токен);
	Элементы.СписокТокенов.Обновить();
	ПоказатьПредупреждение(, Текст);
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьТокенЗавершение(НовыйСрок, Токен) Экспорт
	Если НовыйСрок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Текст = ПродлитьНаСервере(Токен, НовыйСрок);
	Элементы.СписокТокенов.Обновить();
	ПоказатьПредупреждение(, Текст);
КонецПроцедуры

// Снимает активность токена; версия настроек не меняется — токены кэшируются по своим данным (5.2).
&НаСервереБезКонтекста
Функция ОтозватьНаСервере(Токен) Экспорт
	Возврат OData4_Профили.ОтозватьТокен(Токен);
КонецФункции

// Меняет срок действия токена. Отозванный токен не продлевается (решение пользователя: отзыв окончателен),
// новый срок — только в будущем. Возвращает текст итога или отказа.
&НаСервереБезКонтекста
Функция ПродлитьНаСервере(Токен, НовыйСрок) Экспорт
	Отказ = OData4_Профили.ПродлитьТокен(Токен, НовыйСрок);
	Возврат ?(Отказ = "", "Срок действия токена " + Строка(Токен) + ": " + Формат(НовыйСрок, "ДЛФ=DT"), Отказ);
КонецФункции

// Открывает карточку профиля (пустая ссылка — новый профиль); после записи карточка обновляет список.
&НаКлиенте
Процедура ОткрытьКарточкуПрофиля(Профиль)
	Параметры0 = Новый Структура;
	Ключ = Новый УникальныйИдентификатор;
	Если Профиль <> Неопределено Тогда
		Параметры0.Вставить("Профиль", Профиль);
		Ключ = Профиль;
	КонецЕсли;
	ОткрытьФорму("Обработка.OData4_Настройки.Форма.Профиль", Параметры0, ЭтотОбъект, Ключ, , ,
		Новый ОписаниеОповещения("ПослеЗакрытияКарточкиПрофиля", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияКарточкиПрофиля(Результат, ДополнительныеПараметры) Экспорт
	Элементы.СписокПрофилей.Обновить();
КонецПроцедуры

// Карточка профиля записала профиль: список обновляется сразу, не дожидаясь закрытия карточки.
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	Если ИмяСобытия = "OData4_ПрофильЗаписан" Тогда
		Элементы.СписокПрофилей.Обновить();
	КонецЕсли;
КонецПроцедуры

// Пометка удаления профиля текущей строки списка.
&НаКлиенте
Функция ПометкаУдаленияТекущегоПрофиля()
	Данные = Элементы.СписокПрофилей.ТекущиеДанные;
	Возврат Данные <> Неопределено И Данные.ПометкаУдаления;
КонецФункции

&НаКлиенте
Процедура ПометитьПрофильЗавершение(Ответ, Профиль) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Текст = ПереключитьПометкуУдаления(Профиль);
	Элементы.СписокПрофилей.Обновить();
	СписокПрофилейПриАктивизацииСтроки(Элементы.СписокПрофилей);
	ПоказатьПредупреждение(, Текст);
КонецПроцедуры

// Переключает пометку удаления профиля; возвращает текст итога.
&НаСервереБезКонтекста
Функция ПереключитьПометкуУдаления(Профиль)
	Объект0 = Профиль.ПолучитьОбъект();
	Объект0.УстановитьПометкуУдаления(Не Объект0.ПометкаУдаления);
	Возврат ?(Объект0.ПометкаУдаления, "Профиль помечен на удаление: ", "Пометка удаления снята: ") + Объект0.Наименование;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если Не ЗаписатьНаКлиенте() Тогда
			Возврат;
		КонецЕсли;
	ИначеЕсли Ответ <> КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

// Записывает настройки и состав; Истина — записаны. Отказ — сообщение; при изменении настроек после чтения
// форма предлагает перечитать их. Экспорт — для клиентского теста OData4_ТестФормаНастроек.
&НаКлиенте
Функция ЗаписатьНаКлиенте() Экспорт
	Итог = ЗаписатьНаСервере();
	Если ПустаяСтрока(Итог.Текст) Тогда
		Модифицированность = Ложь;
		СоставИзменён = Ложь;
		ПрофилиПользователейИзменены = Ложь;
		Возврат Истина;
	КонецЕсли;
	Если Итог.Конфликт Тогда
		Оповещение = Новый ОписаниеОповещения("ПеречитатьПослеКонфликта", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, Итог.Текст + Символы.ПС + "Перечитать настройки? Изменения в форме будут потеряны.",
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ПоказатьПредупреждение(, Итог.Текст);
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПеречитатьПослеКонфликта(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПрочитатьНастройки();
		ПрочитатьСоставНаСервере();
		ПрочитатьДоступНаСервере();
		Модифицированность = Ложь;
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

// Есть ли несохранённые изменения. Реквизиты формы, не связанные с объектом, платформа модифицированностью
// не отмечает (замечание пользователя 1: изменения терялись молча), поэтому её ставят обработчики изменения
// полей, дерева состава и таблицы профилей. Только клиентские данные: функция вызывается и при завершении
// работы, когда серверные вызовы запрещены.
&НаКлиенте
Функция ЕстьИзменения() Экспорт
	Возврат Модифицированность Или СоставИзменён Или ПрофилиПользователейИзменены;
КонецФункции

// Любое поле настроек изменено: форма помечается модифицированной. Экспорт — для клиентского теста формы.
&НаКлиенте
Процедура НастройкаПриИзменении(Элемент) Экспорт
	ВосстановитьЗначениеИзСписка(Элемент);
	Модифицированность = Истина;
КонецПроцедуры

// Реквизиты формы Настройки_<ресурс> из OData4_НастройкиСервиса.Прочитать(); пустые адреса публикации —
// из навигационной ссылки базы, если она http(s) (решение 11 плана 5.3).
&НаСервере
Процедура ПрочитатьНастройки()
	Значения = OData4_НастройкиСервиса.Прочитать();
	Версия = OData4_НастройкиСервиса.ВерсияИз(Значения);
	ВерсияПриЧтении = ?(Версия = Неопределено, -1, Версия);
	Для Каждого КлючИЗначение Из Значения Цикл
		ИмяРеквизита = "Настройки_" + КлючИЗначение.Ключ;
		Если ЕстьРеквизит(ИмяРеквизита) Тогда
			ЭтотОбъект[ИмяРеквизита] = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	// Пустой адрес публикации не заполняется: навигационная ссылка базы (если это http(s)) — только подсказка
	// и адрес по умолчанию для показа готовых адресов.
	Ссылка = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	АдресПоУмолчанию = "";
	Если СтрНачинаетсяС(НРег(Ссылка), "http://") Или СтрНачинаетсяС(НРег(Ссылка), "https://") Тогда
		АдресПоУмолчанию = Ссылка;
		Элементы.Настройки_АдресПубликации.ПодсказкаВвода = Ссылка;
	КонецЕсли;
	ЗаполнитьАдреса(ЭтотОбъект);
КонецПроцедуры


&НаСервере
Функция ЕстьРеквизит(Имя)
	Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя = Имя Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

// Реквизиты формы → OData4_НастройкиСервиса.Записать: меняются только ресурсы, которые есть на форме; затем
// состав публикации (регистр OData4_Состав), если он менялся на форме.
// Возвращает Структура("Текст, Конфликт"): Текст — причина отказа (пустая — записано): ошибки источников
// CORS или изменение настроек после чтения (оптимистическая проверка ВерсияНастроек, если ресурс есть);
// Конфликт — Истина, если версия настроек изменилась.
&НаСервере
Функция ЗаписатьНаСервере()
	Ошибки = OData4_Журнал.ОшибкиИсточниковCORS(Настройки_ИсточникиCORS);
	Если Ошибки.Количество() > 0 Тогда
		Возврат Новый Структура("Текст, Конфликт", СтрСоединить(Ошибки, Символы.ПС), Ложь);
	КонецЕсли;
	Настройки_СлужебныеПользователи = СлужебныеУчёткиСтрокой();
	Изменения = Новый Структура;
	Для Каждого КлючИЗначение Из OData4_НастройкиСервиса.Прочитать() Цикл
		ИмяРеквизита = "Настройки_" + КлючИЗначение.Ключ;
		Если ЕстьРеквизит(ИмяРеквизита) Тогда
			Изменения.Вставить(КлючИЗначение.Ключ, ЭтотОбъект[ИмяРеквизита]);
		КонецЕсли;
	КонецЦикла;
	Попытка
		OData4_НастройкиСервиса.Записать(Изменения, ?(ВерсияПриЧтении < 0, Неопределено, ВерсияПриЧтении));
	Исключение
		Текст = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Версия = OData4_НастройкиСервиса.ВерсияИз(OData4_НастройкиСервиса.Прочитать());
		Конфликт = ВерсияПриЧтении >= 0 И Версия <> Неопределено И Версия <> ВерсияПриЧтении;
		Возврат Новый Структура("Текст, Конфликт", Текст, Конфликт);
	КонецПопытки;
	Версия = OData4_НастройкиСервиса.ВерсияИз(OData4_НастройкиСервиса.Прочитать());
	ВерсияПриЧтении = ?(Версия = Неопределено, -1, Версия);
	ОбновитьПредупреждениеДоступа();
	Если ПрофилиПользователейИзменены Тогда
		Попытка
			ЗаписатьПрофилиПользователей();
		Исключение
			Возврат Новый Структура("Текст, Конфликт", "Настройки записаны, профили пользователей — нет: "
				+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), Ложь);
		КонецПопытки;
		ПрофилиПользователейИзменены = Ложь;
	КонецЕсли;
	Если СоставИзменён Тогда
		Попытка
			ЗаписатьСостав();
		Исключение
			Возврат Новый Структура("Текст, Конфликт", "Настройки записаны, состав публикации — нет: "
				+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), Ложь);
		КонецПопытки;
		ПрочитатьСоставНаСервере();
	КонецЕсли;
	Возврат Новый Структура("Текст, Конфликт", "", Ложь);
КонецФункции

// Удаляет записи журнала старше Срока (значение поля формы, а не записанной настройки — замечание
// пользователя 9). Возвращает текст итога.
&НаСервереБезКонтекста
Функция ОчиститьСтарыеЗаписиНаСервере(Срок) Экспорт
	Если Не ЗначениеЗаполнено(Срок) Тогда
		Возврат "Срок хранения журнала 0: записи не удаляются.";
	КонецЕсли;
	Граница = ТекущаяУниверсальнаяДатаВМиллисекундах() - Срок * 86400000;
	Удалено = OData4_Очистка.ОчиститьЖурнал(Граница);
	Возврат "Удалено записей старше " + Формат(Срок, "ЧГ=0") + " дн.: " + Формат(Удалено, "ЧН=0; ЧГ=0") + ".";
КонецФункции

// Отборы списка журнала: период по Дата, класс статуса, подстрока субъекта.
&НаКлиенте
Процедура ПрименитьОтбор()
	Отбор = Список.Отбор;
	Отбор.Элементы.Очистить();
	Если ЗначениеЗаполнено(ОтборНачало) Тогда
		ДобавитьОтбор(Отбор, "Дата", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ОтборНачало);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборКонец) Тогда
		// Дата без времени — весь этот день.
		Конец = ?(ОтборКонец = НачалоДня(ОтборКонец), КонецДня(ОтборКонец), ОтборКонец);
		ДобавитьОтбор(Отбор, "Дата", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, Конец);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборСтатус) Тогда
		Нижняя = Число(Лев(ОтборСтатус, 1)) * 100;
		ДобавитьОтбор(Отбор, "Статус", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Нижняя);
		ДобавитьОтбор(Отбор, "Статус", ВидСравненияКомпоновкиДанных.Меньше, Нижняя + 100);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборСубъект) Тогда
		ДобавитьОтбор(Отбор, "Субъект", ВидСравненияКомпоновкиДанных.Содержит, ОтборСубъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтбор(Отбор, Поле, Сравнение, Значение)
	Элемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле);
	Элемент.ВидСравнения = Сравнение;
	Элемент.ПравоеЗначение = Значение;
	Элемент.Использование = Истина;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьАдреса(Форма)
	Адрес = ?(ПустаяСтрока(Форма.Настройки_АдресПубликации), Форма.АдресПоУмолчанию, Форма.Настройки_АдресПубликации);
	Форма.АдресBasic = БезКосой(Адрес) + "/hs/odata/v4/";
	Форма.АдресТокен = БезКосой(Форма.Настройки_АдресПубликацииТокенов) + "/hs/odatat/t/<токен>/v4/";
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция БезКосой(Адрес)
	Результат = СокрЛП(Адрес);
	Пока СтрЗаканчиваетсяНа(Результат, "/") Цикл
		Результат = Лев(Результат, СтрДлина(Результат) - 1);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	Буферизованный = Форма.Настройки_РежимЗаписиЖурнала = "Буферизованный";
	Форма.Элементы.Настройки_РазмерПачкиЖурнала.Доступность = Буферизованный;
	Форма.Элементы.Настройки_ИнтервалПачкиЖурнала.Доступность = Буферизованный;
	Форма.Элементы.ПредупреждениеБуфера.Видимость = Буферизованный;
	Форма.Элементы.ПредупреждениеБуфера.Заголовок = "Пачка — "
		+ Формат(Форма.Настройки_РазмерПачкиЖурнала, "ЧН=0; ЧГ=0") + " записей или "
		+ Формат(Форма.Настройки_ИнтервалПачкиЖурнала, "ЧН=0; ЧГ=0") + " с. Буфер живёт в памяти сеанса и теряется "
		+ "при сбое процесса и при закрытии сеанса после простоя: при редких запросах теряется почти всё.";
	Форма.Элементы.Настройки_СрокЖизниТокеновПродолжения.Доступность = Форма.Настройки_ТокеныПродолжения;
КонецПроцедуры

// Поле «выбор только из списка» очищено (Ctrl+A, Delete; замечание Н-4 ручной проверки 6.3): значение, которого нет
// в списке, заменяется первым значением списка — у всех таких полей настроек это значение по умолчанию.
&НаКлиенте
Процедура ВосстановитьЗначениеИзСписка(Элемент)
	Если ТипЗнч(Элемент) <> Тип("ПолеФормы") Или Элемент.Вид <> ВидПоляФормы.ПолеВвода Тогда
		Возврат;
	КонецЕсли;
	Если Не Элемент.РежимВыбораИзСписка Или Элемент.СписокВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	// ПутьКДанным на клиенте недоступен; у полей настроек имя элемента совпадает с именем реквизита.
	Если Элемент.СписокВыбора.НайтиПоЗначению(ЭтотОбъект[Элемент.Имя]) = Неопределено Тогда
		ЭтотОбъект[Элемент.Имя] = Элемент.СписокВыбора[0].Значение;
	КонецЕсли;
КонецПроцедуры

// Обновление списка журнала (дефект Д-1 ручной проверки 6.3): динамический список перечитывается от текущей строки,
// и записи новее неё остаются выше видимой части; после обновления текущей становится самая новая запись.
&НаКлиенте
Процедура ОбновитьЖурнал()
	Элементы.Журнал.Обновить();
	Ключ = КлючНовейшейЗаписиЖурнала();
	Если Ключ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Попытка
		Элементы.Журнал.ТекущаяСтрока = Ключ;
	Исключение
		// Записи нет в списке (отбор) — текущая строка остаётся прежней.
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючНовейшейЗаписиЖурнала()
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ж.Время КАК Время,
		|	Ж.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.OData4_Журнал КАК Ж
		|
		|УПОРЯДОЧИТЬ ПО
		|	Время УБЫВ");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат РегистрыСведений.OData4_Журнал.СоздатьКлючЗаписи(
		Новый Структура("Время, Идентификатор", Выборка.Время, Выборка.Идентификатор));
КонецФункции

#КонецОбласти
